emacs/config.org
#+TITLE: Emacs Config
#+DESCRIPTION: Personal Config
#+STARTUP: showeverything
#+OPTIONS: toc:2

* TABLE OF CONTENTS :toc:
- [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#package-manager][Package Manager]]
  - [[#load-evil-mode][Load Evil Mode]]
- [[#buffer-move][BUFFER-MOVE]]
- [[#fonts][FONTS]]
  - [[#setting-the-font-face][Setting the Font Face]]
  - [[#zooming-inout][Zooming In/Out]]
- [[#gui-tweaks][GUI TWEAKS]]
  - [[#disable-menubar-toolbar][Disable Menubar, Toolbar]]
  - [[#display-line-numbers-and-truncated-lines][Display Line Numbers and Truncated Lines]]
- [[#org-mode][ORG MODE]]
  - [[#enabling-table-of-contents][Enabling Table of Contents]]
  - [[#enabling-org-bullets][Enabling Org Bullets]]
  - [[#disable-electric-indent][Disable Electric Indent]]
  - [[#source-code-block-expansion][Source Code Block Expansion]]
- [[#which-key][WHICH-KEY]]
- [[#sudo-edit][SUDO EDIT]]
- [[#all-the-icons][ALL THE ICONS]]
- [[#ivy-counsel][IVY (COUNSEL)]]
- [[#shells-and-terminals][SHELLS AND TERMINALS]]
  - [[#eshell][Eshell]]
  - [[#vterm][Vterm]]
- [[#theming][THEMING]]
  - [[#doom-themes][Doom Themes]]
  - [[#doom-modeline-setup][Doom modeline setup]]
- [[#neotree][NEOTREE]]
- [[#filemanager][FILEMANAGER]]
- [[#company][COMPANY]]
- [[#projectile][PROJECTILE]]
- [[#dashboard][DASHBOARD]]

* IMPORTANT PROGRAMS TO LOAD FIRST
** Package Manager

#+BEGIN_SRC emacs-lisp :tangle yes
        (defvar elpaca-installer-version 0.11)
        (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
        (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
        (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
        (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                      :ref nil :depth 1 :inherit ignore
                                      :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                      :build (:not elpaca--activate-package)))
        (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
               (build (expand-file-name "elpaca/" elpaca-builds-directory))
               (order (cdr elpaca-order))
               (default-directory repo))
          (add-to-list 'load-path (if (file-exists-p build) build repo))
          (unless (file-exists-p repo)
            (make-directory repo t)
            (when (<= emacs-major-version 28) (require 'subr-x))
            (condition-case-unless-debug err
                (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                          ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                          ,@(when-let* ((depth (plist-get order :depth)))
                                                              (list (format "--depth=%d" depth) "--no-single-branch"))
                                                          ,(plist-get order :repo) ,repo))))
                          ((zerop (call-process "git" nil buffer t "checkout"
                                                (or (plist-get order :ref) "--"))))
                          (emacs (concat invocation-directory invocation-name))
                          ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                                "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                          ((require 'elpaca))
                          ((elpaca-generate-autoloads "elpaca" repo)))
                    (progn (message "%s" (buffer-string)) (kill-buffer buffer))
                  (error "%s" (with-current-buffer buffer (buffer-string))))
              ((error) (warn "%s" err) (delete-directory repo 'recursive))))
          (unless (require 'elpaca-autoloads nil t)
            (require 'elpaca)
            (elpaca-generate-autoloads "elpaca" repo)
            (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
        (add-hook 'after-init-hook #'elpaca-process-queues)
        (elpaca `(,@elpaca-order))
#+END_SRC

** Load Evil Mode

#+BEGIN_SRC emacs-lisp
    ;; Install use-package support

  (elpaca elpaca-use-package
    ;; Enable :elpaca use-package keyword.
    (elpaca-use-package-mode)
    ;; Assume :elpaca t unless otherwise specified.
    (setq elpaca-use-package-by-default t))

    ;; Block until current queue processed.
    (elpaca-wait)

    (setq evil-want-keybinding nil)
    ;; Expands to: (elpaca evil (use-package evil :demand t))
    (use-package evil
      :init
      (setq evil-want-keybinging nil)
      (setq evil-want-integration t)
      (setq evil-vsplit-window-right t)
      (setq evil-split-window-below t)
      (evil-mode))

    (use-package evil-collection
      :after evil
      :config
      (setq evil-collection-mode-list '(dashboard dired ibuffer))
      (evil-collection-init))
    (use-package evil-tutor)

    ;;Turns off elpaca-use-package-mode current declaration
    ;;Note this will cause evaluate the declaration immediately. It is not deferred.
    ;;Useful for configuring built-in emacs features.
    (use-package emacs :ensure nil :config (setq ring-bell-function #'ignore))
#+END_SRC


**General Keybindings

#+BEGIN_SRC emacs-lisp

  (use-package general
    :config
    (general-evil-setup)

    ;; set up 'SPC' as the global leader key
    (general-create-definer leader-key
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC" ;; set leader
      :global-prefix "M-SPC") ;; access leader in insert mode
  (setq evil-want-keybinding nil)
  (leader-key
    "." '(find-file :wk "Find file")
    "f c" '((lambda () (interactive) (find-file "~/.dotfiles/emacs/config.org")) :wk "Edit emacs config")
    "f r" '(counsel-recentf :wk "Find Recent Files")
    "TAB TAB" '(comment-line :wk "Comment lines"))

     (leader-key
      "b" '(:ignore t :wk "buffer")
      "b b" '(switch-to-buffer :wk "Switch buffer")
      "b i" '(ibuffer :wk "Ibuffer")
      "b k" '(kill-this-buffer :wk "Kill this buffer")
      "b n" '(next-buffer :wk "Next buffer")
      "b p" '(previous-buffer :wk "Previous buffer")
      "b r" '(revert-buffer :wk "Reload buffer"))
    
    (leader-key
      "e" '(:ignore t :wk "Evaluate")
      "e b" '(eval-buffer :wk "Evaluate the elisp in buffer")
      "e d" '(eval-defun :wk "Evaluate defun containing or after point")
      "e e" '(eval-expression :wk "Evaluate elisp expression")
      "e l" '(eval-last-sexp :wk "Evaluate elisp expressions before point")
      "e r" '(eval-region :wk "Evaluate elisp in region")
      "e h" '(counsel-esh-history :which-key "Eshell History")
      "e s" '(eshell :which-key "Eshell")
      )
    (leader-key
    "p" '(projectile-command-map :wk "Projectile"))

    (leader-key
      "h" '(:ignore t :wk "Help")
      "h f" '(describe-function :wk "Describe function")
      "h v" '(describe-variable :wk "Describe Variable")
      "h r r" '((lambda() (interactive) (load-file "~/.dotfiles/emacs/init.el")) :wk "reload emacs config"))

    (leader-key
      "t" '(:ignore t :wk "Toggle")
      "t l" '(display-line-numbers-mode :wk "Toggle line numbers")
      "t t" '(visual-line-mode :wk "Toggle truncated lines"))

    (leader-key
    "w" '(:ignore t :wk "Windows")
    ;; Window splits
    "w c" '(evil-window-delete :wk "Close window")
    "w n" '(evil-window-new :wk "New window")
    "w s" '(evil-window-split :wk "Horizontal split window")
    "w v" '(evil-window-vsplit :wk "Vertical split window")
    ;; Window motions
    "w h" '(evil-window-left :wk "Window Left")
    "w j" '(evil-window-down :wk "Window Down")
    "w k" '(evil-window-up :wk "Window Up")
    "w l" '(evil-window-right :wk "Window Right")
    "w w" '(evil-window-next :wk "Goto Next Window")
    ;; Move Windows
    "w H" '(buf-move-left :wk "Buffer Move Left")
    "w J" '(buf-move-down :wk "Buffer Move Down")
    "w K" '(buf-move-up :wk "Buffer Move Up")
    "w L" '(buf-move-right :wk "Buffer Move Right"))
  )
#+END_SRC

